In [1]:
import pandas as pd

In [9]:
#tab separated
ordres = pd.read_table('http://bit.ly/chiporders')

C:\Users\USER-PC\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.

In [10]:
ordres.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [18]:
#Assign the separator into | and remove header.
movies = pd.read_table('http://bit.ly/movieusers',sep='|',header = None)

C:\Users\USER-PC\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [25]:
#Assign the header into the dataset
user_cols = ['user_id','age','gender','occupation','zip_code']

In [20]:
#adding columns to the dataset
movies.columns = user_cols

In [21]:
movies.head() #check the addition the columns

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [23]:
movies.head(10)

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201
8        9   29      M        student    01002
9       10   53      M         lawyer    90703

In [32]:
#skip 3 row at the top of the dataset-- sometimes there are notes at the top or buttom of file not data you need to skip this.
#to focus on the actual data
pd.read_table('http://bit.ly/movieusers',sep='|',header = None, names=user_cols, skiprows=3).head(5)

C:\Users\USER-PC\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

   user_id  age gender     occupation zip_code
0        4   24      M     technician    43537
1        5   33      F          other    15213
2        6   42      M      executive    98101
3        7   57      M  administrator    91344
4        8   36      M  administrator    05201

In [33]:
#skipfooter: skip number of rows at the buttom of dataset